app/controllers/expense_items_controller.rb

  def index
    @expense_items = ExpenseItem.all
---
SELECT * FROM `expense_items`

  def show
    @page_title = '显示花销记录'
    @expense_item = ExpenseItem.find(params[:id])
---
SELECT * FROM `expense_items` WHERE (`expense_items`.`id` = 1)

  def edit
    @page_title = '更新花销记录'
    @expense_item = ExpenseItem.find(params[:id])
---
SELECT * FROM `expense_items` WHERE (`expense_items`.`id` = 1)

  def create
    @expense_item = ExpenseItem.new(params[:expense_item])
    @expense_item.user_id = session[:user_id]
    respond_to do |format|
      if @expense_item.save
---
INSERT INTO `expense_items` (`updated_at`, `date`, `value`, `expense_type_id`, `note`, `created_at`) VALUES('2010-05-09 03:21:14', '2010-05-09', 3.1, 1, 'hello', '2010-05-09 03:21:14')

  def update
    @expense_item = ExpenseItem.find(params[:id])

    respond_to do |format|
      if @expense_item.update_attributes(params[:expense_item])
---
SELECT * FROM `expense_items` WHERE (`expense_items`.`id` = 1)
UPDATE `expense_items` SET `date` = '2010-05-10', `value` = 8.8, `expense_type_id` = 2, `note` = 'changed to 8.8', `updated_at` = '2010-05-09 03:21:15' WHERE `id` = 1

  def destroy
    @expense_item = ExpenseItem.find(params[:id])
    @expense_item.destroy
---
SELECT * FROM `expense_items` WHERE (`expense_items`.`id` = 1)
DELETE FROM `expense_items` WHERE `id` = 1