app/controllers/expense_tags_controller.rb

SELECT * FROM `expense_tags`
---
  def index
    @expense_tags = ExpenseTag.all

SELECT * FROM `expense_tags` WHERE (`expense_tags`.`id` = 980190962)
---
  def show
    @expense_tag = ExpenseTag.find(params[:id])

SELECT * FROM `expense_tags` WHERE (`expense_tags`.`id` = 980190962)
---
  def edit
    @expense_tag = ExpenseTag.find(params[:id])

INSERT INTO `expense_tags` (`name`, `updated_at`, `created_at`) VALUES('Tag', '2010-05-09 03:21:15', '2010-05-09 03:21:15')
---
  def create
    @expense_tag = ExpenseTag.new(params[:expense_tag])
    @expense_tag.user_id = session[:user_id]
    respond_to do |format|
      if @expense_tag.save

SELECT * FROM `expense_tags` WHERE (`expense_tags`.`id` = 980190962)
---
  def update
    @expense_tag = ExpenseTag.find(params[:id])

SELECT * FROM `expense_tags` WHERE (`expense_tags`.`id` = 980190962)
DELETE FROM `expense_tags` WHERE `id` = 980190962
---
  def destroy
    @expense_tag = ExpenseTag.find(params[:id])
    @expense_tag.destroy