app/controllers/expense_controller.rb

  def index
    date_start, date_end = normalize_date
    @expense_items =
      ExpenseItem.find(:all,
                       :conditions => ["date BETWEEN ? and ?", date_start, date_end],
                       :order => "date DESC")
---
SELECT * FROM `expense_items` WHERE (date BETWEEN '2010-05-01' and '2010-05-31')

  def batch_create
    success = true
    date_from = Date.civil(params[:expense_items][:"date_from(1i)"].to_i,
                           params[:expense_items][:"date_from(2i)"].to_i,
                           params[:expense_items][:"date_from(3i)"].to_i)
    date_to = Date.civil(params[:expense_items][:"date_to(1i)"].to_i,
                          params[:expense_items][:"date_to(2i)"].to_i,
                          params[:expense_items][:"date_to(3i)"].to_i)
    if date_from <= date_to
      (date_from .. date_to).each do|day|
        @expense_item = ExpenseItem.new
        @expense_item.date = day
        @expense_item.user_id = session[:user_id]
        @expense_item.expense_type_id = params[:expense_items][:expense_type_id]
        @expense_item.value = params[:expense_items][:value]
        @expense_item.note = params[:expense_items][:note]
        success = @expense_item.save
---
SELECT * FROM `expense_types`
INSERT INTO `expense_items` (`updated_at`, `date`, `value`, `expense_type_id`, `note`, `created_at`) VALUES('2010-05-09 03:11:58', '2010-05-08', 10.1, 2, 'batch create expense items', '2010-05-09 03:11:58')