app/controllers/expense_types_controller.rb

SELECT * FROM `expense_types`
---
  def index
    @expense_types = ExpenseType.all

SELECT * FROM `expense_types` WHERE (`expense_types`.`id` = 1)
---
  def show
    @expense_type = ExpenseType.find(params[:id])

SELECT * FROM `expense_types` WHERE (`expense_types`.`id` = 1)
---
  def edit
    @expense_type = ExpenseType.find(params[:id])

INSERT INTO `expense_types` (`updated_at`, `description`, `created_at`) VALUES('2010-05-09 03:21:15', 'expense type A', '2010-05-09 03:21:15')
---
  def create
    @expense_type = ExpenseType.new(params[:expense_type])

    respond_to do |format|
      if @expense_type.save

SELECT * FROM `expense_types` WHERE (`expense_types`.`id` = 1)
UPDATE `expense_types` SET `description` = 'expense type B', `updated_at` = '2010-05-09 03:21:15' WHERE `id` = 1
---
  def update
    @expense_type = ExpenseType.find(params[:id])

    respond_to do |format|
      if @expense_type.update_attributes(params[:expense_type])

SELECT * FROM `expense_types` WHERE (`expense_types`.`id` = 1)
DELETE FROM `expense_types` WHERE `id` = 1
---
  def destroy
    @expense_type = ExpenseType.find(params[:id])
    @expense_type.destroy